**Team_Swift** *Recommender System for Lucid.blog*


---



*   importing data from google drive to colab

In [0]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

**DATA_PREPARATION**



*   importing libaries

In [0]:
import pandas as pd
import numpy as np



1.   **User Data**

In [0]:

users_cols = ['user_id', 'fullname', 'username', 'email', 'image', 'email_provider', 'provider_id', 'password', 'remember_token', 'created_at', 'updated_at', 'short_bio']
users = pd.read_csv('/content/drive/My Drive/lucid/users.csv', names=users_cols)
users.drop(['email', 'email_provider', 'image', 'provider_id', 'password', 'remember_token', 'created_at', 'updated_at'], axis=1, inplace=True)

In [42]:
users.head(6)

  user_id  ...                                          short_bio
0      id  ...                                          short_bio
1       1  ...               Software Developer | DevOPs Engineer
2       2  ...                                      Web Developer
3       3  ...  Front End Developer | React Developer | Mentor...
4       4  ...  | Software Developer | DevOps Engineer | @linu...
5       5  ...            I Am lamar and you don't think am real?

[6 rows x 4 columns]




2.   **Posts Data**

In [0]:

posts_cols = ['id', 'user_id', 'title', 'content', 'tags', 'slug', 'created_at', 'updated_at', 'image', 'status_id', 'action',
           'post_id']
posts = pd.read_csv('/content/drive/My Drive/lucid/posts.csv', names=posts_cols)
posts.drop(['title', 'slug', 'updated_at', 'image', 'status_id', 'action', 'post_id'], axis=1, inplace=True)

In [37]:
posts.head(6)

   id  user_id  ...        tags           created_at
0  id  user_id  ...        tags           created_at
1   1     2077  ...         NaN  2019-08-25 20:39:01
2   2     1719  ...  Technology  2019-08-25 20:44:36
3   4     1310  ...         NaN  2019-08-25 20:50:33
4   6     1787  ...         NaN  2019-08-25 20:51:36
5   7      167  ...         NaN  2019-08-25 20:51:39

[6 rows x 5 columns]




3.   **Following Data**

In [0]:

fol_cols = ['id', 'follower_id', 'status']
following = pd.read_csv('/content/drive/My Drive/lucid/following.csv', names=fol_cols)
following.drop([], axis=1, inplace=True)

In [41]:
following.head(6)

      id  follower_id  status
0  my_id  follower_id  status
1      3            6       1
2      6            3       1
3      3            2       1
4      3            7       1
5      7            2       1



4.  **Thoughts Data**

In [0]:

thou_cols = ['id', 'user_id', 'content',
'created_at','updated_at']
thoughts = pd.read_csv('/content/drive/My Drive/lucid/thoughts.csv', names=thou_cols)
thoughts.drop(['updated_at'], axis=1, inplace=True)

In [50]:
thoughts.head(6)

   id  ...           created_at
0  id  ...           created_at
1   1  ...  2019-08-26 14:30:26
2   2  ...  2019-08-26 14:57:35
3   3  ...  2019-08-26 15:35:41
4   4  ...  2019-08-26 16:12:07
5   5  ...  2019-08-26 16:24:55

[6 rows x 4 columns]